In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":["kashif", "atif", "naveed", "raheel"],
    "marks":[90,80,70,60],
    "city":["karachi", "Lahore", "Islamabad", "Multan"]
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  marks       city
0  kashif     90    karachi
1    atif     80     Lahore
2  naveed     70  Islamabad
3  raheel     60     Multan

In [5]:
df.to_csv("friends.csv")

In [6]:
df.to_csv("friends_noindex.csv", index=False)

In [7]:
df.head(2)

     name  marks     city
0  kashif     90  karachi
1    atif     80   Lahore

In [8]:
df.tail(2)

     name  marks       city
2  naveed     70  Islamabad
3  raheel     60     Multan

In [9]:
df.describe()

           marks
count   4.000000
mean   75.000000
std    12.909944
min    60.000000
25%    67.500000
50%    75.000000
75%    82.500000
max    90.000000

In [10]:
kashif = pd.read_csv("Kashif.csv")

In [11]:
kashif

   Unnamed: 0    Name  Class  English  Urdu  Maths  Total
0           0  Kashif      9       98    94     92    281
1           1    Atif      8       86    67     77    230
2           2  Naveed      7       65    56     63    184
3           3   Sobia      6       45    87     23    155
4           4  Fariha      5       34    44     56    134

In [12]:
kashif["Maths"][0] = 93

C:\Users\Kashif\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [13]:
kashif

   Unnamed: 0    Name  Class  English  Urdu  Maths  Total
0           0  Kashif      9       98    94     93    281
1           1    Atif      8       86    67     77    230
2           2  Naveed      7       65    56     63    184
3           3   Sobia      6       45    87     23    155
4           4  Fariha      5       34    44     56    134

In [14]:
kashif.to_csv("Kashif.csv")

In [41]:
newdf = pd.DataFrame(np.random.rand(8,4), index=np.arange(8))

In [43]:
newdf[2]

0    0.776215
1    0.126678
2    0.710344
3    0.116752
4    0.473887
5    0.394051
6    0.188564
7    0.905181
Name: 2, dtype: float64

In [48]:
newdf.index

Int64Index([0, 1, 2, 3, 4, 5, 6, 7], dtype='int64')

In [52]:
kashif.index

RangeIndex(start=0, stop=5, step=1)